// 1 task Постфиксная и префиксная формы
let a = 1,
  b = 1;

let c = ++a; // 2
let d = b++; // 1

// 2 task Результат присваивания
let q = 2;

let x = 1 + (q *= 2); // q = 4 x = 5

// 3 task Преобразование типов
"" + 1 + 0; // 10
"" - 1 + 0; // -1
true + false; // 1
6 / "3"; // 2
"2" * "3"; // 6
4 + 5 + "px"; // 9px
"$" + 4 + 5; // $45
"4" - 2; // 2
"4px" - 2; // NaN
"  -9  " + 5; // -9 5
"  -9  " - 5; // -14
null + 1; // 1
undefined + 1; // NaN
" \t \n" - 2; // -2

// 4 task Исправьте сложение
let r = prompt("Первое число?", 1);
let t = prompt("Второе число?", 2);

alert(+r + +t); // 3
